templates/014C.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v01="urn:http://brz.gv.at/ezoll/V01">
    <soapenv:Header/>
    <soapenv:Body>
        <v01:sendMessages>
            <arrayOfTransitRequestBean_1>
                <id>1</id>
                <message><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<ns2:Msg xmlns:ns2="http://brz.gv.at/ezoll/V01" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<ns2:MsgSdr>Wirtschaftsbeteiligter</ns2:MsgSdr>
<ns2:MsgRcp>NTA.AT</ns2:MsgRcp>
<ns2:PrepDT>{{object.PrepDT}}</ns2:PrepDT>
<ns2:ICRef>{{object.ICRef}}</ns2:ICRef>
<ns2:Appl>acc</ns2:Appl>
<ns2:Test>1</ns2:Test>
<ns2:MsgTyp>CC014C</ns2:MsgTyp>
<!--_______________________________________End of AT Header_________________________________________-->

<ns4:CC014C xmlns:ns4="urn:eds:datamodel:EDS:EDS_EXTENSIONS:1" xmlns:ns3="http://ncts.dgtaxud.ec"> 
	<Extensions>
		<ns3:SequenceNumeric>{{object.SequenceNumeric}}</ns3:SequenceNumeric>
		<ns3:Key>{{object.Key}}</ns3:Key>
		<ns3:Value>{{object.Value}}</ns3:Value>
		<ns3:DataType>{{object.DataType}}</ns3:DataType>
	</Extensions>
	<messageSender>{{object.messageSender}}</messageSender>
	<messageRecipient>{{object.messageRecipient}}</messageRecipient>
	<preparationDateAndTime>{{object.preparationDateAndTime}}</preparationDateAndTime>
	<messageIdentification>{{object.messageIdentification}}</messageIdentification>
	<messageType>{{object.messageType}}</messageType>
	<correlationIdentifier>{{object.correlationIdentifier}}</correlationIdentifier>
	<TransitOperation>
		<MRN>{{object.MRN}}</MRN>
	</TransitOperation>
	<Invalidation>
		<requestDateAndTime>{{object.requestDateAndTime}}</requestDateAndTime>
		<initiatedByCustoms>{{object.initiatedByCustoms}}</initiatedByCustoms>
		<justification>{{object.justification}}</justification>
	</Invalidation>
	<CustomsOfficeOfDeparture>
		<referenceNumber>{{object.referenceNumber}}</referenceNumber>
	</CustomsOfficeOfDeparture>
	<HolderOfTheTransitProcedure>
		<identificationNumber>{{object.identificationNumber}}</identificationNumber>
		<ContactPerson>
			<name>{{object.name}}</name>
			<phoneNumber>{{object.phoneNumber}}</phoneNumber>
			<eMailAddress>{{object.eMailAddress}}</eMailAddress>
		</ContactPerson>
	</HolderOfTheTransitProcedure>
</ns3:CC014C>

<!--_______________________________________Start of AT Footer_______________________________________-->
</ns2:Msg>]]>
                </message>
                <operatorId>ReleaseTest01</operatorId>
            </arrayOfTransitRequestBean_1>
        </v01:sendMessages>
    </soapenv:Body>
</soapenv:Envelope>